public class Main {
    public static void main(String[] args) {
        /*(задание с *)есть строка  в которой нужно поменять местами две
        заданные буквы.
        Известно, что эти буквы в строке есть.
        пример: String str = "asDfghjklRre";  поменять D и R*/

        /*1- есть строка четной длины и нужно вывести на экран эту строку но при
        этом первая половина
        букв будет в нижнем регистре а вторая в верхнем
        Helloh -> helLOH*/
        /*2- Имеется строка. Нужно вывести на экран эту строку без символа,
        находящегося по индексу index
        int index =3
        String str = "Hello"
        -> Helo*/


    }
}